// Написати програму де компютер загадає число від 1 до 10 і
// запропонує користувачу вгадати його Користувач вводить свій
// варіант і отримує результат (Виграв чи ні) Вивести результат в
// форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви
// програли, компютер загадав (тут варіант компютера)"

 let a = Math.round(Math.random() * 10)
let b = prompt('вгадайте число від 1 до 10');
    if(b === null){
    alert("ви нажали cancel, оновіть сторінку та введіть число") 
}
    else if(b == a){
        alert(`Вітаю ви вгадали число ${a}`)}
        else{
            alert(`Ви програли, компютер загадав ${a}`)}
