// Написати програму яка переведе введену оцінку студента до
//               болонського формату 89 - 100 це A 75 - 88 це B 60 - 74 це C 45 -
//               59 це D 20 - 44 це Е до 20 це F
let rate = +(prompt('введіть вашу оцінку'))
if(rate > 100){
    alert('Ви ввели неіснуючий бал ')
}
else if(rate < 0){
    alert('Ви ввели неіснуючий бал ')
}
   else if((rate <= 100)&&(rate >= 89)){
      alert('Ваша оцінка A ');
}
    else if((rate <= 88)&&(rate >= 75)){
       alert('Ваша оцінка B ');
    }
        else if((rate <= 74)&&(rate >= 60)){
          alert('Ваша оцінка C ')
        }
           else if((rate <= 59)&&(rate >= 45)){
              alert('Ваша оцінка D ')
        }
                else if((rate <= 44)&&(rate >= 20)){
                  alert('Ваша оцінка E ')
        }             else if((rate <= 19)&&(rate >= 0)){
                           alert('Ваша оцінка F ')
        }